import { Link } from "react-router-dom";

const PrivacyPolicy = () => {
    return (
        <div id="privacy-policy">
            <h1>Политика за поверителност</h1>

            <div className="content">
                <p>Последна актуализация: 20.02.2025</p>
                <p>
                    1. Въведение Тази Политика за поверителност описва как
                    <span> AquaCraft</span> ("ние", "нас" или "нашата компания")
                    събира, използва и споделя информация, когато използвате нашия уебсайт
                    <span> aquacraft.ltd</span> ("Сайтът"). Чрез достъп или използване на Сайта вие се съгласявате с практиките, описани в тази Политика за поверителност.
                </p>
                <p>2. Информация, която събираме.</p>
                <p>
                    2.1. Лична информация Можем да събираме лична информация, която доброволно предоставяте, като вашето име, имейл адрес и друга контактна информация, когато попълвате формуляри на Сайта или се свързвате с нас.
                </p>
                <p>
                    2.2. Нелична информация Можем да събираме нелична информация относно вашето взаимодействие със Сайта, като вашия IP адрес, тип браузър и данни за използването.
                </p>
                <p>
                    3. Как използваме информацията Можем да използваме събраната информация за различни цели, включително:
                </p>
                <p>3.1. За предоставяне и поддържане на Сайта.</p>
                <p>3.2. За отговаряне на вашите заявки, коментари или въпроси.</p>
                <p>3.3. За изпращане на периодични имейли, актуализации или други съобщения.</p>
                <p>3.4. За подобряване на нашите услуги и вашето преживяване на Сайта.</p>
                <p>
                    4. Споделяне на информация Ние не продаваме или отдаваме под наем вашата лична информация на трети страни. Въпреки това можем да споделяме информация с доставчици на услуги, бизнес партньори или други трети страни, когато това е необходимо за целите, описани в тази Политика за поверителност.
                </p>
                <p>
                    5. Бисквитки и технологии за проследяване Сайтът може да използва бисквитки и други технологии за проследяване за събиране и съхранение на информация. Можете да контролирате използването на бисквитки чрез настройките на вашия браузър.
                </p>
                <p>
                    6. Връзки към трети страни Сайтът може да съдържа връзки към уебсайтове или услуги на трети страни. Ние не носим отговорност за практиките за поверителност на тези трети страни. Препоръчваме ви да прегледате техните политики за поверителност.
                </p>
                <p>
                    7. Сигурност на данните Прилагаме разумни мерки за защита на вашата лична информация от неоторизиран достъп, разкриване, промяна или унищожаване. Все пак, нито един метод на предаване през интернет или електронно съхранение не е напълно сигурен и не можем да гарантираме абсолютна сигурност.
                </p>
                <p>
                    8. Промени в тази Политика за поверителност Можем да актуализираме тази Политика за поверителност, за да отразим промени в нашите практики или поради други оперативни, правни или регулаторни причини. Ще публикуваме актуализираната Политика за поверителност на Сайта и ревизираната политика ще влезе в сила след публикуването.
                </p>
                <p>
                    9. Свържете се с нас Ако имате въпроси или притеснения относно тази Политика за поверителност, моля свържете се с нас на{" "}
                    <Link className="edit-btn" to="/contact">
                        Контакт
                    </Link>
                    . Това е общ шаблон. Моля, консултирайте се с правен специалист, за да сте сигурни, че вашата политика за поверителност отговаря на всички приложими закони и разпоредби във вашата юрисдикция и е съобразена със спецификата на вашия уебсайт или приложение.
                </p>
            </div>
        </div>
    );
};

export default PrivacyPolicy;