const TermsAndConditions = () => {
    return (
        <div id="terms-and-conditions">
            <h1>Условия за ползване</h1>

            <div className="content">
                <p>
                    Чрез достъп и използване на този уебсайт вие се съгласявате да бъдете обвързани с условията, изложени в тези условия за ползване.
                    Моля, прочетете внимателно тези условия преди да използвате нашия уебсайт. Ако не сте съгласни с някое от тези условия, моля не използвайте този уебсайт.
                    Нашите условия за ползване могат да бъдат променяни. Ваша отговорност е да проверявате редовно тази страница за актуализации.
                </p>
            </div>
        </div>
    );
}

export default TermsAndConditions;